Documents/ПокупкаКорма.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ПокупкаКорма</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СебестоимостьКотят</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Коробка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Коробки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьКорма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОстаткиКотятВКоробках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиКотятВКоробках</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Коробка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Коробки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Порода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Породы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/СебестоимостьКотят.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>СебестоимостьКотят</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Себестоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Коробка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Коробки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Порода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Породы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ПокупкаКорма/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиКотятВКоробкахОстатки.Порода КАК Порода,
		|	ОстаткиКотятВКоробкахОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиКотятВКоробках.Остатки(&МоментВремени, Коробка = &Коробка) КАК ОстаткиКотятВКоробкахОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ОстаткиКотятВКоробкахОстатки.КоличествоОстаток) КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиКотятВКоробках.Остатки(&МоментВремени, Коробка = &Коробка) КАК ОстаткиКотятВКоробкахОстатки";
	
	Запрос.УстановитьПараметр("Коробка", Коробка);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	РезультатЗапроса = ПакетЗапросов[0].Выбрать();
	ОбщееКоличество = ПакетЗапросов[1].Выбрать();
	
	Если ОбщееКоличество.Следующий() Тогда
		Себестоимость = ?(ОбщееКоличество.КоличествоОстаток = 0, 0, СтоимостьКорма / ОбщееКоличество.КоличествоОстаток)	
	КонецЕсли;
	
	Движения.СебестоимостьКотят.Записывать = Истина;
	
	Пока РезультатЗапроса.Следующий() Цикл
		Движение = Движения.СебестоимостьКотят.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
		Движение.Период 		= Дата;
		Движение.Коробка 		= Коробка;
		Движение.Порода 		= РезультатЗапроса.Порода;
		Движение.Себестоимость 	= Себестоимость;
	КонецЦикла;
	
КонецПроцедуры
